{
  "metadata": {
    "query": "next js ",
    "subreddit": "all",
    "num_posts_requested": 10,
    "num_posts_found": 10,
    "sort_by": "relevance",
    "timestamp": "2025-01-19 01:07:13"
  },
  "posts": [
    {
      "title": "ive wasted so much time with next js",
      "author": "mrdanmarks",
      "score": 193,
      "upvote_ratio": 0.83,
      "num_comments": 155,
      "created_utc": "2024-11-07 00:08:24",
      "url": "https://www.reddit.com/r/webdev/comments/1gl5l8b/ive_wasted_so_much_time_with_next_js/",
      "is_self": true,
      "selftext": "tl;dr ; i need a new web framework that can read cookies and talk to an API\n\nlong story:\n\nI wanted an app so I built an ios/android app with react native and node express. i made register, forgot password, verify email endpoints, and a small react website to facilitate basic app needs and host support/privacy/legal pages. it took me about a year to get it setup and running in the app store close to what I wanted. after that it was time to get the website up to the same level as the react natve app. and for some godawful reason, I chose next js. it was supposed to be more robust than react, faster loading, server side rendering, better SEO, I'm sure you guys are aware of the hyped up reasons. but FFS, this thing has thrown more curveballs into my development plan, where now I feel like I have no idea what I'm doing. i struggled with trying to integrate an authentication package since I already have authentication tools, so much it took me months to scrap all that and roll my own. i think I'm moving forward with basic development, but then I cant manage user settings in a context as I would expect. and it all feels like a waste of time. or maybe I need to mutate my react query data from my user call, not store anything in contexts and do everything on the fly. who the fuck knows\n\nNow I'm considering going to PHP or some other language and rebuilding everything for the web all over because making headway in next is just a giant PIA\n\nI'm so frustrated, and feel like I've got nothing to show for it\n\nand to save you time from your snarky comments, its probably a skill issue",
      "permalink": "https://reddit.com/r/webdev/comments/1gl5l8b/ive_wasted_so_much_time_with_next_js/",
      "subreddit": "webdev",
      "id": "1gl5l8b",
      "flair": null,
      "domain": "self.webdev",
      "is_video": false,
      "over_18": false,
      "spoiler": false,
      "stickied": false
    },
    {
      "title": "We are finally moved out of Next.Js",
      "author": "Prainss",
      "score": 200,
      "upvote_ratio": 0.83,
      "num_comments": 186,
      "created_utc": "2024-09-18 11:26:19",
      "url": "https://www.reddit.com/r/nextjs/comments/1fjluh2/we_are_finally_moved_out_of_nextjs/",
      "is_self": true,
      "selftext": "Hello, fellow next.js fanboy here.\n\nWorked on a project with RSC and app router starting with next 13.4. to 14.1 Was so happy with server actions, server-client composing.\n\nBut finally we decided to move out of Next and return to Vite\n\n**Reason 1. Dev server**\n\nIt sucks. Even with turbopack. It was so slow, that delivering simple changes was a nightmare in awaiting of dev server modules refresh. After some time we encountered strange bug, that completely shut down fast refresh on dev server and forced us to restart it each time we made any change.\n\n**Reason 2. Bugs**\n\nFirst - very strange bug with completely ununderstandable error messages that forced us to restart dev server each time we made any change. Secondly - if you try to build complex interactive modules, try to mix server-client compositions you will always find strange bugs/side-effects that either not documented or have such unreadable error messages that you have to spend a week to manually understand and fix it\n\n**Reason 3. Server-client limitations**\n\nWhen server actions bring us a lot of freedom and security when working with backend, it also gives us a lot of client limitation. \n\nSimple example is Hydration. You must always look up for hydration status on your application to make sure every piece of code you wrote attached correctly and workes without any side-effects.\n\nMost of the react libraries that brings us advantages of working with interactivity simply dont work when business comes to RSC and you must have to choose alternative or write one for yourself\n\n  \nI still believe and see next js as a tool i could use in my future projects, but for now i think i would stick all my projects with SPA and Remix, in case i need SSR",
      "permalink": "https://reddit.com/r/nextjs/comments/1fjluh2/we_are_finally_moved_out_of_nextjs/",
      "subreddit": "nextjs",
      "id": "1fjluh2",
      "flair": "Discussion",
      "domain": "self.nextjs",
      "is_video": false,
      "over_18": false,
      "spoiler": false,
      "stickied": false
    },
    {
      "title": "NextJs is hard",
      "author": "grossmail1",
      "score": 130,
      "upvote_ratio": 0.92,
      "num_comments": 98,
      "created_utc": "2023-11-26 21:35:50",
      "url": "https://www.reddit.com/r/nextjs/comments/184dy3r/nextjs_is_hard/",
      "is_self": true,
      "selftext": "I’ve seen posts like this all over the place and I wanted to share my recent journey to hopefully give some of you guys hope.\n\nI’ve been a software developer for nearly 10 years and I’ve been writing react code for 7. It seems like a lot of folks in both next and react sub reddits are doing more hobby projects but I’m not being sarcastic when I say I’ve been using react on large scale apps with real world problems EVERY DAY for those 7 years.\n \nI am leading a POC to see if I can get our react app (200k+ daily users) over to a next application. The mental model switch from purely CSR over to SSR has been tough. I18n and auth in particular have been really difficult. I’ll admit I was fortunate enough to really start digging in after next 13.x+ so I don’t have the old page model to contend with.\n\nThis POC has really forced me to look at where I should be rendering components. What can happen on the server and what has to happen on the client. BUT I’ll be honest. This challenge is exciting. It blows me away how much performance I’ll gain by having unauthenticated users(and crawlers) accessing as much cached data as possible. Far fewer round trips for data. And a cleaner developer experience when it comes to dealing with loading and layout components. I still run into hiccups all the time but solving problems is a HUGE part of the job. So have hope. I can’t imagine trying to learn next without any prior experience. But if you can make it through you’ll be better because of it.",
      "permalink": "https://reddit.com/r/nextjs/comments/184dy3r/nextjs_is_hard/",
      "subreddit": "nextjs",
      "id": "184dy3r",
      "flair": null,
      "domain": "self.nextjs",
      "is_video": false,
      "over_18": false,
      "spoiler": false,
      "stickied": false
    },
    {
      "title": "How do you guys decide between using next.js or react.js project ?",
      "author": "green_viper_",
      "score": 42,
      "upvote_ratio": 0.77,
      "num_comments": 72,
      "created_utc": "2024-07-26 13:40:36",
      "url": "https://www.reddit.com/r/reactjs/comments/1eciqa3/how_do_you_guys_decide_between_using_nextjs_or/",
      "is_self": true,
      "selftext": "So, the thing is whenever I start a project, I start with next.js because of its server side support, and blah blah blah. But as I move forward, I findmyself using more and more \"use client\" directive. For example I have to use react hook forms for form management on the root, that requries to use \"use client\" directive. and if my pages have to be built on client side, what's the point of using next.js other than vite react ?\n\nWhat do you guys say for bulding something like an admin pannel, next.js or react.js ?",
      "permalink": "https://reddit.com/r/reactjs/comments/1eciqa3/how_do_you_guys_decide_between_using_nextjs_or/",
      "subreddit": "reactjs",
      "id": "1eciqa3",
      "flair": "Needs Help",
      "domain": "self.reactjs",
      "is_video": false,
      "over_18": false,
      "spoiler": false,
      "stickied": false
    },
    {
      "title": "Am I Missing Out by Not Using NextJS?",
      "author": "iEmerald",
      "score": 129,
      "upvote_ratio": 0.85,
      "num_comments": 122,
      "created_utc": "2024-04-19 21:24:54",
      "url": "https://www.reddit.com/r/webdev/comments/1c80c8r/am_i_missing_out_by_not_using_nextjs/",
      "is_self": true,
      "selftext": "I'm a solo developer, mostly working on freelance projects where I have the luxury of picking my own stack.\n\nDepending on the project I either use Django for the backend AND frontend (No SPA, everything is server rendered).\n\nOr, if the client wants and if I see any benefit in an SPA, I would go the DRF (API) + Plain React route.\n\nI used NextJS for a while when building an SPA and I felt like I was fighting it with \"use client\" all over the place. If I want to have good SEO then I would just use Django as I mentioned.\n\nAnything I'm missing out here?",
      "permalink": "https://reddit.com/r/webdev/comments/1c80c8r/am_i_missing_out_by_not_using_nextjs/",
      "subreddit": "webdev",
      "id": "1c80c8r",
      "flair": "Discussion",
      "domain": "self.webdev",
      "is_video": false,
      "over_18": false,
      "spoiler": false,
      "stickied": false
    },
    {
      "title": "Do people still build with React js or is Next Js etc now the default?",
      "author": "Sea-dante-10",
      "score": 35,
      "upvote_ratio": 0.83,
      "num_comments": 53,
      "created_utc": "2024-05-22 17:20:13",
      "url": "https://www.reddit.com/r/react/comments/1cxybcx/do_people_still_build_with_react_js_or_is_next_js/",
      "is_self": true,
      "selftext": "Recently I've been bogged down with React Js. I am an aspiring full stack developer so alongside React Js I also learn Node/express and have extended that learning to include topics such as authentication and socket io. \n\nIs it necessary to try to learn react in depth? I want to tackle some commercial level projects but it seems like Next js or Remix is how people are building full stack apps nowadays.\n\nIs it perfectly fine to learn and build using React js alone or should I start focusing on a full stack framework to actually build?",
      "permalink": "https://reddit.com/r/react/comments/1cxybcx/do_people_still_build_with_react_js_or_is_next_js/",
      "subreddit": "react",
      "id": "1cxybcx",
      "flair": "General Discussion",
      "domain": "self.react",
      "is_video": false,
      "over_18": false,
      "spoiler": false,
      "stickied": false
    },
    {
      "title": "My personal site, built with NextJS and ChakraUI",
      "author": "Mik3rophone",
      "score": 2296,
      "upvote_ratio": 0.97,
      "num_comments": 208,
      "created_utc": "2021-06-19 10:22:42",
      "url": "https://v.redd.it/1wvvekz7l5671",
      "is_self": false,
      "selftext": "",
      "permalink": "https://reddit.com/r/webdev/comments/o38i2j/my_personal_site_built_with_nextjs_and_chakraui/",
      "subreddit": "webdev",
      "id": "o38i2j",
      "flair": "Showoff Saturday",
      "domain": "v.redd.it",
      "is_video": true,
      "over_18": false,
      "spoiler": false,
      "stickied": false
    },
    {
      "title": "Issues with Indexing My Next.js Website on Google",
      "author": "i4technolab",
      "score": 3,
      "upvote_ratio": 1.0,
      "num_comments": 2,
      "created_utc": "2024-08-23 14:25:31",
      "url": "https://www.reddit.com/r/nextjs/comments/1ez7x0r/issues_with_indexing_my_nextjs_website_on_google/",
      "is_self": true,
      "selftext": "I’ve built a website using Next.js, and the URL is [https://www.apiintegrationtech.com/](https://www.apiintegrationtech.com/). The site was published on August 14th, 2024, but it is still not indexed.\n\nI’ve tried multiple times to request indexing through Google Search Console, but my site and its pages are still not being indexed. I’ve checked all the parameters like `sitemap.xml`, `robots.txt`, and ensured there are no `no-index` tags, but I can’t figure out why Google isn’t indexing my site. Can someone please help me identify the reason?",
      "permalink": "https://reddit.com/r/nextjs/comments/1ez7x0r/issues_with_indexing_my_nextjs_website_on_google/",
      "subreddit": "nextjs",
      "id": "1ez7x0r",
      "flair": "Help",
      "domain": "self.nextjs",
      "is_video": false,
      "over_18": false,
      "spoiler": false,
      "stickied": false
    },
    {
      "title": "NextJS vs Rails - A real comparison - Criticism Welcome",
      "author": "Secure-Buyer7594",
      "score": 23,
      "upvote_ratio": 0.76,
      "num_comments": 51,
      "created_utc": "2024-05-07 16:34:58",
      "url": "https://www.reddit.com/r/nextjs/comments/1cm97lc/nextjs_vs_rails_a_real_comparison_criticism/",
      "is_self": true,
      "selftext": "I’m a react dev that has shipped a few production apps in react and decided to try out nextjs over the last couple weeks and have been thinking a lot about whether it’s better to invest time in rails instead as nextjs has run into a few issues for me.\n\nMy thoughts so far -\n- NextJS introduces a lot of breaking changes with each version, which causes app maintainability to be a lot harder over the long term. The issue with react is a lot of the older apps are harder to maintain.\n- Alternatively Rails is a mature framework which I won’t need to relearn the wheel everytime I update my app which has been the issue so far as I’d like to focus on the actual business logic of the app and not maintainability. My main focus is shipping fast.\n- The main benefit of Next being that it’s been used by everyone at the moment so there’s a lot of libraries and support available, however some of the older stuff is breaking already for me and not usable\n\nAnyways eager to get everyone’s thoughts.\n",
      "permalink": "https://reddit.com/r/nextjs/comments/1cm97lc/nextjs_vs_rails_a_real_comparison_criticism/",
      "subreddit": "nextjs",
      "id": "1cm97lc",
      "flair": "Discussion",
      "domain": "self.nextjs",
      "is_video": false,
      "over_18": false,
      "spoiler": false,
      "stickied": false
    },
    {
      "title": "core-js maintainer: “So, what’s next?”",
      "author": "jdf2",
      "score": 4418,
      "upvote_ratio": 0.96,
      "num_comments": 949,
      "created_utc": "2023-02-14 02:46:57",
      "url": "https://github.com/zloirock/core-js/blob/master/docs/2023-02-14-so-whats-next.md",
      "is_self": false,
      "selftext": "",
      "permalink": "https://reddit.com/r/programming/comments/111k9aq/corejs_maintainer_so_whats_next/",
      "subreddit": "programming",
      "id": "111k9aq",
      "flair": null,
      "domain": "github.com",
      "is_video": false,
      "over_18": false,
      "spoiler": false,
      "stickied": false
    }
  ]
}